module.exports = {
    diagrams: [
        {
            id: '1',
            title: 'Пример диаграммы',
            createdAt: '2024-01-15T10:30:00Z',
            updatedAt: '2024-01-20T14:45:00Z',
            nodes: [
                {
                    id: 'node_1',
                    type: 'RECTANGLE',
                    x: 100,
                    y: 150,
                    width: 200,
                    height: 100,
                    text: 'Начальный процесс'
                },
            ],
            arrows: []
        },
    ]
};
// todo разобраться как сделать чтоб не падал сервер при попытке запустить с пустымм объектом вместо диаграмм

//todo сделать кнопку сохранения на сервер и виджет выбора диаграмм
//  то есть локально можно работать с одной диаграммой офлайн
//  а на сервере сохраняться все диаграммы